In [121]:
# Aula 1 - Análise de Dados com Pandas

In [122]:
import pandas as pd

In [123]:
df = pd.read_csv("salaries.csv")

In [124]:
## Extraindo informacoes básicas sobre o DataFrame

In [125]:
### Retorna as 5 primeiras linhas do DataFrame
df.head()

### Retorna a quantidade de linhas passadas como parametro
df.head(10)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100.0,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100.0,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0.0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0.0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0.0,US,M
5,2025.0,EN,FT,Data Engineer,80000,USD,80000,US,0.0,US,M
6,2025.0,SE,FT,Data Scientist,185000,USD,185000,US,0.0,US,M
7,2025.0,SE,FT,Data Scientist,148000,USD,148000,US,0.0,US,M
8,2025.0,MI,FT,Data Scientist,135000,USD,135000,CA,0.0,CA,M
9,2025.0,MI,FT,Data Scientist,108000,USD,108000,CA,0.0,CA,M

In [126]:
### Retorna informações sobre o DataFrame
### Ex: número de entradas, tipos de dados e valores nulos
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 74035 entries, 0 to 74034
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           74030 non-null  float64
 1   experience_level    74035 non-null  str
 2   employment_type     74035 non-null  str
 3   job_title           74035 non-null  str
 4   salary              74035 non-null  int64
 5   salary_currency     74035 non-null  str
 6   salary_in_usd       74035 non-null  int64
 7   employee_residence  74035 non-null  str
 8   remote_ratio        74034 non-null  float64
 9   company_location    74034 non-null  str
 10  company_size        74034 non-null  str
dtypes: float64(2), int64(2), str(7)
memory usage: 6.2 MB

In [127]:
### Retorna estatísticas descritivas do DataFrame
### Ex: média, desvio padrão, valores mínimos e máximos
df.describe()

          work_year        salary  salary_in_usd  remote_ratio
count  74030.000000  7.403500e+04   74035.000000  74034.000000
mean    2024.818884  1.628727e+05  156492.346552     19.862496
std        0.385362  2.284340e+05   76014.679446     39.876452
min     2022.000000  1.440000e+04   15157.000000      0.000000
25%     2025.000000  1.040000e+05  104000.000000      0.000000
50%     2025.000000  1.450000e+05  145000.000000      0.000000
75%     2025.000000  1.968000e+05  196000.000000      0.000000
max     2025.000000  3.000000e+07  800000.000000    100.000000

In [128]:
### Retorna o número de linhas e colunas do DataFrame
df.shape

(74035, 11)

In [129]:
### Armazena o número de linhas e colunas em variáveis separadas
linhas, colunas = df.shape[0], df.shape[1]
print('Linhas:', linhas)
print('Colunas:', colunas)

Linhas: 74035
Colunas: 11

In [130]:
### Retorna os nomes das colunas do DataFrame
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='str')

In [131]:
## Renomeando as colunas do DataFrame

In [132]:
novos_nomes = {
    'work_year': 'ano',
    'experience_level': 'senioridade',
    'employment_type': 'contrato',
    'job_title': 'cargo',
    'salary': 'salario',
    'salary_currency': 'moeda',
    'salary_in_usd': 'usd',
    'employee_residence': 'residencia',
    'remote_ratio': 'remoto',
    'company_location': 'empresa',
    'company_size': 'tamanho_empresa'
}

### Aplica renomeação
df.rename(columns=novos_nomes, inplace=True)
df.head(10)

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100.0,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100.0,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0.0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0.0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0.0,US,M
5,2025.0,EN,FT,Data Engineer,80000,USD,80000,US,0.0,US,M
6,2025.0,SE,FT,Data Scientist,185000,USD,185000,US,0.0,US,M
7,2025.0,SE,FT,Data Scientist,148000,USD,148000,US,0.0,US,M
8,2025.0,MI,FT,Data Scientist,135000,USD,135000,CA,0.0,CA,M
9,2025.0,MI,FT,Data Scientist,108000,USD,108000,CA,0.0,CA,M

In [133]:
## Analisando categorias das colunas categóricas

In [134]:
### Nível de senioridade
### O método para contar quantas vezes cada valor único aparece em uma coluna
df['senioridade'].value_counts()

#### Legenda dos níveis de senioridade
#### SE	Senior	Profissional experiente (nível sênior)
#### MI	Mid	Nível intermediário
#### EN	Entry	Iniciante ou júnior (entry-level)
#### EX	Executive	Executivo, liderança sênior (C-Level)

senioridade
SE    42125
MI    22952
EN     7000
EX     1958
Name: count, dtype: int64

In [135]:
### Tipo de contrato
df['contrato'].value_counts()

#### Legenda dos tipos de contrato
#### FT Full-time	Tempo integral – trabalho padrão de 40h/semana ou período completo
#### PT Part-time	Meio período – carga horária reduzida
#### CT Contract	Contrato temporário ou por projeto – geralmente por prazo determinado
#### FL Freelance	Freelancer – trabalho autônomo ou por demanda, sem vínculo formal

contrato
FT    73478
CT      300
PT      257
Name: count, dtype: int64

In [148]:
### Regime de trabalho
df['remoto'].value_counts()

#### Legenda dos regimes de trabalho
#### 0 Presencial
#### 100 Remoto
#### 50 Híbrido

remoto
presencial    59305
remoto        14681
hibrido          48
Name: count, dtype: int64

In [147]:
### Cargo mais frequente
df['cargo'].value_counts()

cargo
Software Engineer               8912
Data Scientist                  7327
Engineer                        6760
Data Engineer                   6707
Data Analyst                    6221
                                ...
AI Engineering Manager             1
Analytics Analyst                  1
Controls Engineer                  1
Business Development Manager       1
Business Insights Manager          1
Name: count, Length: 294, dtype: int64

In [149]:
# País dos profissionais
df['residencia'].value_counts()

residencia
US    65831
CA     3315
GB     2031
AU      347
NL      293
      ...
AM        2
KE        1
AE        1
ZM        1
RW        1
Name: count, Length: 74, dtype: int64

In [150]:
# País de sede das empresas
df['empresa'].value_counts()

empresa
US    65840
CA     3314
GB     2031
AU      348
NL      293
      ...
AM        2
KE        1
AE        1
ZM        1
NG        1
Name: count, Length: 73, dtype: int64

In [154]:
# Salarios por moeda
df['moeda'].value_counts()

moeda
USD    69680
GBP     2004
EUR     1697
CAD      383
INR       75
PLN       73
PHP       22
AUD       18
CHF       18
TWD       17
SGD       14
JPY        8
BRL        8
HUF        6
CZK        5
NOK        3
ZAR        2
MXN        1
DKK        1
Name: count, dtype: int64

In [155]:
# Salarios (média, min, max)
df['usd'].describe()

count     74035.000000
mean     156492.346552
std       76014.679446
min       15157.000000
25%      104000.000000
50%      145000.000000
75%      196000.000000
max      800000.000000
Name: usd, dtype: float64

In [137]:
## Modificando o nome das categorias

In [138]:
senioridade = {
    'SE': 'senior',
    'MI': 'pleno',
    'EN': 'junior',
    'EX': 'executivo'
}
df['senioridade'] = df['senioridade'].replace(senioridade)
df['senioridade'].value_counts()

senioridade
senior       42125
pleno        22952
junior        7000
executivo     1958
Name: count, dtype: int64

In [139]:
contrato = {
    'FT': 'integral',
    'PT': 'parcial',
    'CT': 'contrato',
    'FL': 'freelancer'
}
df['contrato'] = df['contrato'].replace(contrato)
df['contrato'].value_counts()

contrato
integral    73478
contrato      300
parcial       257
Name: count, dtype: int64

In [146]:
tamanho_empresa = {
    'L': 'grande',
    'S': 'pequena',
    'M': 'media'
}

df['tamanho_empresa'] = df['tamanho_empresa'].replace(tamanho_empresa)
df['tamanho_empresa'].value_counts()

tamanho_empresa
media      72470
grande      1554
pequena       10
Name: count, dtype: int64

In [141]:
mapa_trabalho = {
    0: 'presencial',
    100: 'remoto',
    50: 'hibrido'
}

df['remoto'] = df['remoto'].replace(mapa_trabalho)
df['remoto'].value_counts()

remoto
presencial    59305
remoto        14681
hibrido          48
Name: count, dtype: int64

In [142]:
df.head(10)

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,senior,integral,Solutions Engineer,214000,USD,214000,US,remoto,US,media
1,2025.0,senior,integral,Solutions Engineer,136000,USD,136000,US,remoto,US,media
2,2025.0,pleno,integral,Data Engineer,158800,USD,158800,AU,presencial,AU,media
3,2025.0,pleno,integral,Data Engineer,139200,USD,139200,AU,presencial,AU,media
4,2025.0,junior,integral,Data Engineer,90000,USD,90000,US,presencial,US,media
5,2025.0,junior,integral,Data Engineer,80000,USD,80000,US,presencial,US,media
6,2025.0,senior,integral,Data Scientist,185000,USD,185000,US,presencial,US,media
7,2025.0,senior,integral,Data Scientist,148000,USD,148000,US,presencial,US,media
8,2025.0,pleno,integral,Data Scientist,135000,USD,135000,CA,presencial,CA,media
9,2025.0,pleno,integral,Data Scientist,108000,USD,108000,CA,presencial,CA,media

In [143]:
### Resume informações categóricas com o método describe(), exibindo a quantidade de categorias únicas, categoria mais frequente e respectiva frequência:
df.describe(include='object')

/tmp/ipykernel_25970/4044743911.py:2: Pandas4Warning: For backward compatibility, 'str' dtypes are included by select_dtypes when 'object' dtype is specified. This behavior is deprecated and will be removed in a future version. Explicitly pass 'str' to `include` to select them, or to `exclude` to remove them and silence this warning.
See https://pandas.pydata.org/docs/user_guide/migration-3-strings.html#string-migration-select-dtypes for details on how to write code that works with pandas 2 and 3.
  df.describe(include='object')

,senioridade,contrato,cargo,moeda,residencia,remoto,empresa,tamanho_empresa
count,74035,74035,74035,74035,74035,74034,74034,74034
unique,4,3,294,19,74,3,73,3
top,senior,integral,Software Engineer,USD,US,presencial,US,media
freq,42125,73478,8912,69680,65831,59305,65840,72470

In [144]:
### Para pandas versões 1.0.0 e superiores, que introduziram o dtype 'string', é possível incluir ambos os tipos textuais de duas formas:
#### 1. Inclui explicitamente ambos os dtypes textuais
df.describe(include=['object', 'string'])

,senioridade,contrato,cargo,moeda,residencia,remoto,empresa,tamanho_empresa
count,74035,74035,74035,74035,74035,74034,74034,74034
unique,4,3,294,19,74,3,73,3
top,senior,integral,Software Engineer,USD,US,presencial,US,media
freq,42125,73478,8912,69680,65831,59305,65840,72470

In [145]:
#### 2. Ou selecionar colunas textuais e descrever apenas elas
df.select_dtypes(include=['object', 'string']).describe()

,senioridade,contrato,cargo,moeda,residencia,remoto,empresa,tamanho_empresa
count,74035,74035,74035,74035,74035,74034,74034,74034
unique,4,3,294,19,74,3,73,3
top,senior,integral,Software Engineer,USD,US,presencial,US,media
freq,42125,73478,8912,69680,65831,59305,65840,72470